mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf16xm/mb9bf16xm.svd
        <!-- REGISTER "TIMER2INTCLR" -->
        <register derivedFrom="TIMER1INTCLR">
          <name>TIMER2INTCLR</name>
          <description>Interrupt Clear Register [W]</description>
          <addressOffset>0x2C</addressOffset>
        </register>
        <!-- REGISTER "TIMER2RIS" -->
        <register>
          <name>TIMER2RIS</name>
          <description>Interrupt Status Register [W]</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TIMER2RIS" -->
            <field>
              <name>TIMER2RIS</name>
              <description>Interrupt Status Register bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TIMER2MIS" -->
        <register>
          <name>TIMER2MIS</name>
          <description>Masked Interrupt Status Register [W]</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TIMER2MIS" -->
            <field>
              <name>TIMER2MIS</name>
              <description>Masked Interrupt Status bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TIMER2BGLOAD" -->
        <register derivedFrom="TIMER1BGLOAD">
          <name>TIMER2BGLOAD</name>
          <description>Background Load Register [W]</description>
          <addressOffset>0x38</addressOffset>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "MFT0" -->
    <peripheral>
      <name>MFT0</name>
      <description>Multifunction Timer 0</description>
      <version>A</version>
      <groupName>MFT</groupName>
      <baseAddress>0x40020000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x102</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x106</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10A</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10E</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x112</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x116</offset>
        <size>0xE</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x125</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x128</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x12C</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x134</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x13C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x142</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x146</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14E</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x152</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x15A</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x15E</offset>
        <size>0xD</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x16C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x170</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x176</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x17A</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x17E</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x182</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x188</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18E</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x196</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x19E</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1A8</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1AC</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1B0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1B4</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1BA</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1BE</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C2</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C6</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1CA</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1CE</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1D4</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1D8</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1DC</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1E0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1E4</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1E8</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "MFT0_WFG_DTIF" -->
      <interrupt>
        <name>MFT0_WFG_DTIF</name>
        <value>21</value>
      </interrupt>
      <!-- INTERRUPT "MFT0_FRT_PEAK" -->
      <interrupt>
        <name>MFT0_FRT_PEAK</name>
        <value>24</value>
      </interrupt>
      <!-- INTERRUPT "MFT0_FRT_ZERO" -->
      <interrupt>
        <name>MFT0_FRT_ZERO</name>
        <value>25</value>
      </interrupt>
      <!-- INTERRUPT "MFT0_ICU" -->
      <interrupt>
        <name>MFT0_ICU</name>
        <value>26</value>
      </interrupt>
      <!-- INTERRUPT "MFT0_OCU" -->
      <interrupt>
        <name>MFT0_OCU</name>
        <value>27</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "FRT_TCCP0" -->
        <register>
          <name>FRT_TCCP0</name>
          <description>FRT-ch.0 Cycle Setting Register [HW]</description>
          <alternateGroup>FRT</alternateGroup>
          <addressOffset>0x142</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TCCP" -->
            <field>
              <name>TCCP</name>
              <description>Count Cycle Setting Bits</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FRT_TCDT0" -->
        <register>
          <name>FRT_TCDT0</name>
          <description>FRT-ch.0 Count Value Register [HW]</description>
          <alternateGroup>FRT</alternateGroup>
          <addressOffset>0x146</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "FRT_TCSA0" -->
        <register>
          <name>FRT_TCSA0</name>
          <description>FRT-ch.0 Control Register A [BHW]</description>
          <alternateGroup>FRT</alternateGroup>
          <addressOffset>0x148</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0040</resetValue>
          <resetMask>0xE3FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ECKE" -->
            <field>
              <name>ECKE</name>
              <description>Uses an external input clock (FRCK) as FRT's count clock</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IRQZF" -->
            <field>
              <name>IRQZF</name>
              <description>zero interrupt flag</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IRQZE" -->
            <field>
              <name>IRQZE</name>
              <description>Generates interrupt when TCSA.IRQZF is set</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ICLR" -->
            <field>
              <name>ICLR</name>
              <description>interrupt flag</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ICRE" -->
            <field>
              <name>ICRE</name>
              <description>Generates interrupt when TCSA.ICLR is set</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BFE" -->
            <field>
              <name>BFE</name>
              <description>Enables TCCP's buffer function</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STOP" -->
            <field>
              <name>STOP</name>
              <description>Puts FRT in stopping state</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MODE" -->
            <field>
              <name>MODE</name>
              <description>FRT's count mode</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCLR" -->
            <field>
              <name>SCLR</name>
              <description>FRT operation state initialization request</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "CLK" -->
            <field>
              <name>CLK</name>
              <description>FRT clock cycle</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FRT_TCSC0" -->
        <register>
          <name>FRT_TCSC0</name>
          <description>FRT-ch.0 Control Register C [HW]</description>
          <alternateGroup>FRT</alternateGroup>
          <addressOffset>0x14A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MSPC" -->
            <field>
              <name>MSPC</name>
              <description>Current counter value of a Peak value detection mask counter</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSZC" -->
            <field>
              <name>MSZC</name>
              <description>Current counter value of a Zero value detection mask counter</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSPI" -->
            <field>
              <name>MSPI</name>
              <description>Masked Peak value detection number</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSZI" -->
            <field>
              <name>MSZI</name>
              <description>Masked Zero value detection number</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FRT_TCCP1" -->
        <register derivedFrom="FRT_TCCP0">
          <name>FRT_TCCP1</name>
          <description>FRT-ch.1 Cycle Setting Register [HW]</description>
          <alternateGroup>FRT</alternateGroup>
          <addressOffset>0x14E</addressOffset>
        </register>
