mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf16xm/mb9bf16xm.svd
        <!-- REGISTER "BREG39" -->
        <register>
          <name>BREG39</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x139</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG3A" -->
        <register>
          <name>BREG3A</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x13A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG3B" -->
        <register>
          <name>BREG3B</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x13B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG3C" -->
        <register>
          <name>BREG3C</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x13C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG3D" -->
        <register>
          <name>BREG3D</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x13D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG3E" -->
        <register>
          <name>BREG3E</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x13E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG3F" -->
        <register>
          <name>BREG3F</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x13F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG40" -->
        <register>
          <name>BREG40</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x140</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG41" -->
        <register>
          <name>BREG41</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x141</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG42" -->
        <register>
          <name>BREG42</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x142</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG43" -->
        <register>
          <name>BREG43</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x143</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG44" -->
        <register>
          <name>BREG44</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x144</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG45" -->
        <register>
          <name>BREG45</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x145</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG46" -->
        <register>
          <name>BREG46</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x146</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG47" -->
        <register>
          <name>BREG47</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x147</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG48" -->
        <register>
          <name>BREG48</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x148</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG49" -->
        <register>
          <name>BREG49</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x149</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG4A" -->
        <register>
          <name>BREG4A</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x14A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
