mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf16xm/mb9bf16xm.svd
        <!-- REGISTER "SNINTSGE" -->
        <register>
          <name>SNINTSGE</name>
          <description>Normal Interrupt Signal Enable Register [BHW]</description>
          <addressOffset>0x38</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x1FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RETUNEEVTG" -->
            <field>
              <name>RETUNEEVTG</name>
              <description>Re-Tuning Event Signal Enable</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INT_CG" -->
            <field>
              <name>INT_CG</name>
              <description>INT_C Signal Enable</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INT_BG" -->
            <field>
              <name>INT_BG</name>
              <description>INT_B Signal Enable</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INT_AG" -->
            <field>
              <name>INT_AG</name>
              <description>INT_A Signal Enable</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CARDINTG" -->
            <field>
              <name>CARDINTG</name>
              <description>Card Interrupt Signal Enable</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CARDRMVG" -->
            <field>
              <name>CARDRMVG</name>
              <description>Card Removal Signal Enable</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CARDINSG" -->
            <field>
              <name>CARDINSG</name>
              <description>Card Insertion Signal Enable</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BUFRDRDYG" -->
            <field>
              <name>BUFRDRDYG</name>
              <description>Buffer Read Ready Signal Enable</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BUFWRRDYG" -->
            <field>
              <name>BUFWRRDYG</name>
              <description>Buffer Write Ready Signal Enable</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DMAINTG" -->
            <field>
              <name>DMAINTG</name>
              <description>DMA Interrupt Signal Enable</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLCKGEVNTG" -->
            <field>
              <name>BLCKGEVNTG</name>
              <description>Block Gap Event Signal Enable</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRSFCMPLTG" -->
            <field>
              <name>TRSFCMPLTG</name>
              <description>Transfer Complete Signal Enable</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMDCMPLTG" -->
            <field>
              <name>CMDCMPLTG</name>
              <description>Command Complete Signal Enable</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SEINTSGE" -->
        <register>
          <name>SEINTSGE</name>
          <description>Error Interrupt Signal Enable Register [BHW]</description>
          <addressOffset>0x3A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x77FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "AHBMSTERRG" -->
            <field>
              <name>AHBMSTERRG</name>
              <description>AHB Master Error Signal Enable</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ACMD19ERRG" -->
            <field>
              <name>ACMD19ERRG</name>
              <description>Auto CMD19 Error Signal Enable</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BTACKERRG" -->
            <field>
              <name>BTACKERRG</name>
              <description>Boot Acknowledge Error Signal Enable</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TUNINGERRG" -->
            <field>
              <name>TUNINGERRG</name>
              <description>Tuning Error Signal Enable</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADMAERRG" -->
            <field>
              <name>ADMAERRG</name>
              <description>ADMA Error Signal Enable</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ACMD12ERRG" -->
            <field>
              <name>ACMD12ERRG</name>
              <description>Auto CMD Error Signal Enable</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CRTLMTERRG" -->
            <field>
              <name>CRTLMTERRG</name>
              <description>Current limit Error Signal Enable</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DTEBERRG" -->
            <field>
              <name>DTEBERRG</name>
              <description>Data End Bit Error Signal Enable</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DTCRCERRG" -->
            <field>
              <name>DTCRCERRG</name>
              <description>Data CRC Error Signal Enable</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DTTOERRG" -->
            <field>
              <name>DTTOERRG</name>
              <description>Data Timeout Error Signal Enable</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMDIDXERRG" -->
            <field>
              <name>CMDIDXERRG</name>
              <description>Command Index Error Signal Enable</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMDEBERRG" -->
            <field>
              <name>CMDEBERRG</name>
              <description>Command End Bit Error Signal Enable</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMDCRCERRG" -->
            <field>
              <name>CMDCRCERRG</name>
              <description>Command CRC Error Signal Enable</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMDTOERRG" -->
            <field>
              <name>CMDTOERRG</name>
              <description>Command Timeout Error Signal Enable</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
